exam/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       12922;
    }
    slip-walls
    {
        type            wall;
        nFaces          50;
        startFace       12947;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       12997;
    }
    obstacle
    {
        type            wall;
        nFaces          27;
        startFace       13022;
    }
    empty
    {
        type            empty;
        nFaces          17134;
        startFace       13049;
    }
)

// ************************************************************************* //
